IDEA StatiCa Open Model
WeldType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 enum of weld types
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum WeldType
Public Enumeration WeldType
public enum class WeldType
Members
Member name | Value | Description
NotSpecified | 0 |  NotSpecified
Fillet | 1 |  Fillet
DoubleFillet | 2 |  DoubleFillet
Bevel | 4 |  Bevel
Square | 8 |  Square
Plug | 16 |  Plug
LengthAtHaunch | 32 |  LengthAtHaunch
FilletRear | 64 |  FilletRear
Contact | 128 |  Contact
Intermittent | 256 |  Intermittent
See Also
Reference
IdeaRS.OpenModel.Connection Namespace